// noinspection BadExpressionStatementJS
({
    type: "main",
    name: "四年的回忆",
    stage: "大四",
    pages: [
        {
            id: "start",
            text: [
                "毕业的日子近了。",
                "答辩结束、完成提交论文的你，第一次轻装上阵，重新行走在清华校园。"
            ],
            actions: [
                jump("xiguan")
            ]
        },
        {
            id: "xiguan",
            image: "四年回忆/系馆.jpg",
            text: [
                "你首先来到东主楼前。",
                "你曾来这里开班会、做实验、检查大作业、参加编程机考。",
                "甚至曾来这里查过某门专业课的期末试卷，为自己在考试中的错误懊悔不已。",
                "虽然东主楼不是校园里最显眼的系馆，但9区、10区的办公室、实验室里都留下了你的足迹。",
                "你轻轻摸了摸东主楼前计算机科学与技术系的大理石门牌。"
            ]
            ,
            actions: [
                jump("zongti")
            ]
        },
        {
            id: "zongti",
            image: "四年回忆/综体.jpg",
            text: [
                "向北走去，你来到了综合体育馆门口。",
                "2014年8月28日，你在这里参加了本科生开学典礼，正式成为清华的一员。",
                "你也许还来这里看过晚会、学生节，也许也在一层的健身房向理想的身材迈进。",
                "再过几天，这里也将成为你本科生涯的落幕之处。",
                "四年转瞬即逝。还真有一点伤感呢。"
            ],
            actions: [
                jump("caochang")
            ]
        },
        {
            id: "caochang",
            image: "四年回忆/操场.jpg",
            text: [
                "继续向北，你来到了学生区，经过了棒球场、北操、篮球场、网球场和紫操。",
                "你曾在夕阳下拖着因上课疲惫的身体阳光长跑，却发现一排打卡机都已经黑屏“挂掉”。",
                "你也许还无数次作为班队、系队的一员，一次次完善自己的射门、投篮、挥拍。",
                "你低头望了望自己因运动减少微微发福的腰身，轻轻叹了口气。",
                "“毕业后也要坚持锻炼呀。”"
            ],
            actions: [
                jump("canting")
            ]
        },
        {
            id: "canting",
            image: "四年回忆/紫荆.jpg",
            text: [
                "快到宿舍了，但你还是先去了一趟紫荆园食堂。",
                "还没到饭点，一排排桌椅显得有些空旷。",
                "大家都说：“清华的食堂又便宜又好吃。”",
                "但直到临近毕业之时，你才发现，清华食堂的各种口味，总有那几种已经成为你心中的五星美食。",
                "看到“麻辣香锅”几个字，你咽了咽口水。",
                "“今晚就吃锅吧。”"
            ]
        }
    ]
})
