// noinspection BadExpressionStatementJS
[
    {
        name: "考入北大",
        stage: "简单结局",
        image: "结局/考入北大.jpg",
        text: [
            "你成功考入了北京大学信息科学技术学院。",
            "想必你在那里也会度过精彩的四年。不过，这就是另外一个故事了。"
        ]
    },
    {
        name: "看破红尘",
        stage: "隐藏结局",
        image: "结局/看破红尘.jpg",
        text: [
            "当初的高中同学都大学毕业了，而你还在参加高考。经过四年的复读，你参透了一些人生的真理。",
            "其实人生在世，何必这么辛苦呢？并不是万事都要做到最完美，人无完人，孰能无过？",
            "你的修为远远超过了一众凡人，成功拿到了龙泉寺的全奖offer。"
        ]
    },
    {
        name: "被迫退学",
        stage: "悲伤结局",
        image: "结局/被迫退学.jpg",
        text: [
            "在学期间，你有超过20学分的课程考核不合格。",
            "根据《清华大学本科生学籍管理规定》，你被退学。",
            "本不该如此的。",
            "希望你能吸取教训，好好学习。"
        ]
    },
    {
        name: "结业快乐",
        stage: "扎心结局",
        image: "结局/结业快乐.jpg",
        text: [
            "你按部就班地完成了学业，本来是可以顺利毕业的。",
            "可惜，毕业前最后的考试中出了意外，你没能通过。",
            "根据《清华大学本科生学籍管理规定》，你只能获得结业证书。你需要在第二年再次参加考试，通过方可以结业证书换发毕业证书。",
            "来年加油！"
        ]
    }
]