({
    "开题": "基于大数据和统计学习的“世界上最好的语言”问题求解",
    "中期": "使用自动化脚本，已在GitHub、StackOverflow、知乎、虎扑等知名论坛发起讨论贴万余篇",
    "最终": "使用爬虫收集回答，搭建神经网络，将收集的回答用于训练",
    "论文": {
        "标题": "基于大数据和统计学习的“世界上最好的语言”问题求解",
        "摘要": [
            "当今世界，随着IT产业的快速发展，计算机语言的数目也呈急剧增长之势。如何选择一门编程语言，便成了困扰众多程序员的重要问题。",
            "在本论文中，我们结合大数据、数据挖掘、统计学习，对这一问题给出了权威回答：PHP是世界上最好的语言。",
            "我的基本方法为：首先利用自动化脚本在GitHub、StackOverflow、知乎、虎扑步行街等发送大量讨论帖。",
            "然后使用爬虫收集并提取答案，特别地，我们基于情感分析系统对引战度较高的回答给予极高的权重。",
            "之后，将数据送入基于RNN神经网络的生成模型中进行训练，然后随机采样获取网络回答。",
            "我们进行了23333次随机采样，得到的回答结果均为：“PHP是世界上最好的语言！”",
            "这一问题得到了完美解决。"
        ]
    }
})
